
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/YumNumm/rx2530-infra/actions/runs/15786622075)



<pre><code>Apply complete! Resources: 0 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
lxd_project.default: Refreshing state... [name=default]
lxd_instance.packer_lxd: Refreshing state... [name=packer-lxd]
lxd_instance.github_actions_runner: Refreshing state... [name=github-actions-runner]
lxd_instance.common: Refreshing state... [name=common]
lxd_instance.monitor: Refreshing state... [name=monitor]
lxd_instance.tv: Refreshing state... [name=tv]
lxd_instance.media: Refreshing state... [name=media]
lxd_instance.ubuntu_desktop: Refreshing state... [name=ubuntu-desktop]
lxd_instance.eqmonitor: Refreshing state... [name=eqmonitor]
lxd_instance.nginx: Refreshing state... [name=nginx]
lxd_instance.loki: Refreshing state... [name=loki]
lxd_instance.win11: Refreshing state... [name=win11]
lxd_instance.sandbox: Refreshing state... [name=sandbox]
lxd_instance.docker_registry: Refreshing state... [name=docker-registry]
lxd_instance.network: Refreshing state... [name=network]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # lxd_instance.sandbox will be updated in-place
  ~ resource "lxd_instance" "sandbox" {
      ~ interfaces       = {
          - "eth0" = {
              - ips   = [
                  - {
                      - address = "10.17.201.148" -> null
                      - family  = "inet" -> null
                      - scope   = "global" -> null
                    },
                  - {
                      - address = "fd42:3ac3:1908:966c:216:3eff:fe13:e3af" -> null
                      - family  = "inet6" -> null
                      - scope   = "global" -> null
                    },
                  - {
                      - address = "fe80::216:3eff:fe13:e3af" -> null
                      - family  = "inet6" -> null
                      - scope   = "link" -> null
                    },
                ] -> null
              - name  = "eth0" -> null
              - state = "up" -> null
              - type  = "broadcast" -> null
            },
        } -> (known after apply)
      ~ ipv4_address     = "172.18.0.1" -> (known after apply)
      + ipv6_address     = (known after apply)
      ~ location         = null -> (known after apply)
      ~ mac_address      = "7e:99:91:c8:55:57" -> (known after apply)
        name             = "sandbox"
      ~ status           = "Running" -> (known after apply)
        # (10 unchanged attributes hidden)

      - device {
          - name       = "disk-device-4" -> null
          - properties = {
              - "path"   = "/home/yumnumm/wikijs"
              - "source" = "/mnt/HDD/container/wikijs"
            } -> null
          - type       = "disk" -> null
        }
      + device {
          + name       = "disk-device-5"
          + properties = {
              + "path"   = "/home/yumnumm/HDD"
              + "source" = "/mnt/HDD/"
            }
          + type       = "disk"
        }
      + device {
          + name       = "ftp"
          + properties = {
              + "bind"    = "instance"
              + "connect" = "tcp:0.0.0.0:23"
              + "listen"  = "tcp:0.0.0.0:23"
            }
          + type       = "proxy"
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
lxd_instance.sandbox: Modifying... [name=sandbox]
lxd_instance.sandbox: Modifications complete after 1s [name=sandbox]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":15,"Program":"tfcmt","SHA1":"6cb29789c08bf6c0fea67a8f9768b656fd9cda3d","Vars":{},"WorkflowName":"Terraform Apply"} -->